#+TITLE: the-python-way
#+AUTHOR: lujun9972
#+CATEGORY: Python
#+DATE: [2016-05-01 日 10:14]
#+OPTIONS: ^:{}

** for 循环
python 的 ~for~ 与 C++中的 for 是不同的,它专指 "for each"

+ 若只想遍历 list 中的元素,只需要使用 =for in= 便利即可

  #+BEGIN_SRC python
    for i in ['a', 'b', 'c']:
        print(i)
  #+END_SRC

  #+RESULTS:
  : a
  : b
  : c

+ 若想同时遍历多个 list,使用 ~for~ 与 ~zip~ 组合
  #+BEGIN_SRC python
    l1 = ["a", "b", "c", "d", "e"]
    l2 = ["A", "B", "C", "D", "E"]
    l3 = ["甲", "乙", "丙", "丁", "戊"]

    for i in zip(l1, l2, l3):
        print(i)
  #+END_SRC

  #+RESULTS:
  : ('a', 'A', '甲')
  : ('b', 'B', '乙')
  : ('c', 'C', '丙')
  : ('d', 'D', '丁')
  : ('e', 'E', '戊')

+ 若想便利 list 中的元素同时还需要元素的索引,使用 ~for~ 与 ~enumerate~
  #+BEGIN_SRC python
    l1 = ["a", "b", "c", "d", "e"]

    for index, value in enumerate(l1, start=1):
        print(index, value)
  #+END_SRC

  #+RESULTS:
  : 1 a
  : 2 b
  : 3 c
  : 4 d
  : 5 e

** 连续比较
这是诸多语言中少有的简便方法
#+BEGIN_SRC python
  print(3 > 2 > 1 > 0)
  print(1 < 2 > 0)
#+END_SRC

#+RESULTS:
: True
: True

** 交换变量
Python 支持直接交换变量
#+BEGIN_SRC python
  a, b = 1, 2
  print(a, b)
  a, b = b, a
  print(a, b)
#+END_SRC

#+RESULTS:
: 1 2
: 2 1

** 格式化输出
一般使用 string 的 format 方法进行格式化输出
#+BEGIN_SRC python
  # {}的内容会被 format()中的参赛所替代
  print('{} is a {}'.format('Cescfangs', 'gooner'))

  # 可以在{}里填上数字来指定 format()中的第几个参赛
  print('{1} is a {0}'.format('gooner', 'Cescfangs'))

  # 若{}里填上的是参数名,则会使用 format 中的同名函数的值
  print('{Ramsey} is a {gunner}'.format(gunner='gooner', Ramsey='Cescfangs'))

  # 还可以使用:对输出的范围进行控制,我们输出 pi 的小数点后三位
  import math
  print('value of pi is {0:.3f}'.format(math.pi))

  # :还可以起到输出固定位数的作用
  arsenal = {'Ramsey': 16, 'Rosciky': 7, 'Chambers': 21, 'Ozil': 11}
  for player, number in arsenal.items():
      print('{0:10}-->{1:3d}'.format(player, number))
#+END_SRC

#+RESULTS:
: Cescfangs is a gooner
: Cescfangs is a gooner
: Cescfangs is a gooner
: value of pi is 3.142
: Chambers  --> 21
: Ozil      --> 11
: Ramsey    --> 16
: Rosciky   -->  7

** ++i 不等于 i+=1
Python 不支持 =++/--= 操作,因此会将 =++i= 解释成 =+(+i)= ,其中+表示正数符号.
#+BEGIN_SRC python
  i = 1
  print(+1)
  print(++1)
  print(+++1)
#+END_SRC

#+RESULTS:
: 1
: 1
: 1

对于 =--i= 也是类似

** 三元操作符"?:"

Python 本身不支持三元操作符 =?:= . =C?X:Y= 在 Python 中等价形式为 =X if C else Y=
#+BEGIN_SRC python
  X = 0
  Y = -2
  print(X if X < Y else Y)
#+END_SRC

#+RESULTS:
: -2

** switch..case
Python 中没有 C 语言那样的 =switch..case= 分支语句. 一般使用 =if..elif..else= 语
句代替, 会使用跳转表来实现:
#+BEGIN_SRC python
  def f(x):
      return {
          0: "You typed zero.",
          1: "You typed one.",
          2: "You typed two."
      }.get(x, "You Typed Other Number")


  print(f(1))
  print(f(3))
#+END_SRC

#+RESULTS:
: You typed one.
: You Typed Other Number

** 使用推导式代替循环
当出现如下类似的代码时,考虑改写成列表推导式
#+BEGIN_SRC python
  evens = []
  for i in range(10):
      if i % 2 == 0:
          evens.append(i)

  print(evens)
#+END_SRC

#+RESULTS:
: [0, 2, 4, 6, 8]

写成列表推导式的形式为:
#+BEGIN_SRC python
  evens = [i for i in range(10) if i % 2 == 0]
  print(evens)
#+END_SRC

#+RESULTS:
: [0, 2, 4, 6, 8]

使用列表推导式的写法除了高效外,也更加简短,容易理解.
** 装饰器
装饰器其实只是一种语法糖
#+BEGIN_SRC python
  @decorator
  def func():
      pass
#+END_SRC
其实就是
#+BEGIN_SRC python
  func = decorator(func)
#+END_SRC
的简写形式.

这里 decorator 甚至不需要是一个函数, 类也可以用来构建装饰器,只要它实现了 =__call__= 方法:
#+BEGIN_SRC python
  class logit(object):
      def __init__(self, logfile='out.log'):
          self.logfile = logfile

      def __call__(self, func):
          log_string = func.__name__ + " was called"
          print(log_string)
          with open(self.logfile, 'a') as opened_file:
              opened_file.write(log_string+'\n')
          self.notify()

      def notify(self):
          pass


  @logit()
  def myfunc1():
      pass
#+END_SRC

#+RESULTS:
: myfunc1 was called

使用装饰器类的一个好处是可以使用继承.

